In [2]:
import pandas as pd
df=pd.read_csv('gapminder.tsv',sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [6]:
df.shape

(1704, 6)

In [7]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [10]:
df.dtypes
#object: 문자열

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [11]:
#R에서 str함수와 같은 함수
#주로 결측값 확인할 때 많이 씀
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [15]:
cdf=df['country']
type(cdf)

pandas.core.series.Series

In [16]:
cdf.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [17]:
cdf.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

### 전체집합에서 부분열 추출하는 작업

In [22]:
subset=df[['country','continent','year']]
subset

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [ ]:
"""loc: 라벨(행,열 이름)을 가지고 데이터를 추출"
   iloc: 정수를 가지고 데이터를 추출
""

### loc: 라벨(행,열 이름)을 가지고 데이터를 추출"

In [ ]:

#데이터프레임.loc[행 인덱스]
#데이터프레임.loc[행 인덱스, 열 인덱스 ]

In [26]:
import pandas as pd
import numpy as np

In [28]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [30]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [31]:
df['a':'b']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [32]:
df.loc['a':'b']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [34]:
#두 개 이상의 행을 지정할 때는 [[]]
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [35]:
df.A

a    10
b    14
c    18
Name: A, dtype: int64

In [36]:
df['A']

a    10
b    14
c    18
Name: A, dtype: int64

In [38]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [39]:
df[df.A>15]
#데이터프레임으로 출력됨

    A   B   C   D
c  18  19  20  21

In [40]:
#위의 결과와 동일
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [41]:
def select_rows(df):
    return df.A>15

In [44]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [45]:
df.loc[select_rows(df)] #True인 행 반환

    A   B   C   D
c  18  19  20  21

In [47]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [52]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [53]:
df2['A'] #열 추출

0    10
1    14
2    18
3    22
Name: A, dtype: int64

In [55]:
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

### 행,열 인덱스 추출

In [62]:
#A열 0행 추출
df
df.loc['a'].loc['A']
#or
df.loc['a','A'] #행 인덱스가 a, 열 인덱스가 A인 위치의 값을 추출해라

10

In [63]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [64]:
df.loc['a':]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [66]:
df.loc['a':,'A']

a    10
b    14
c    18
Name: A, dtype: int64

In [67]:
df.loc['a']
#or
df.loc['a',:]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [72]:
#퀴즈1
df.loc['a':'b',['B','D']]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [73]:
df.loc['a':'b', ['B','D']]

    B   D
a  11  13
b  15  17

In [74]:
df.loc[:'b',['B','D']]

    B   D
a  11  13
b  15  17

In [75]:
df.loc[['a','b'],['B','D']]

    B   D
a  11  13
b  15  17

In [76]:
df.A>10

a    False
b     True
c     True
Name: A, dtype: bool

In [77]:
df.loc[df.A>10]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [78]:
df.loc[df.A>10,['C','D']]

    C   D
b  16  17
c  20  21

In [79]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [83]:
df.loc['a','B']

11

In [84]:
#iloc는 문자를 쓸 수 없음
df.iloc[0] #기본적으로 숫자 인덱스가 0번부터 부여되어 있다고 가정

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [87]:
df.iloc[:2] #0번~2-1번 행인덱스에 해당되는 데이터가 추출(포함하지 않음)
df.loc[:'c']  #a행~c행(포함)인덱스에 해당하는 데이터 추출(포함)

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [92]:
df.iloc[0:2,2]

a    12
b    16
Name: C, dtype: int64

In [102]:
#퀴즈2
#1) 12,13 추출
#2) 19,20
#3)18,19,20,21

df.iloc[0:1,2:4]
df.iloc[2:3,1:3]
df.iloc[2,:]

A    18
B    19
C    20
D    21
Name: c, dtype: int64

In [103]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int64

In [108]:
df.iloc[-1]=df.iloc[-1]*2

df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  72  76  80  84

In [109]:
df=pd.read_csv('gapminder.tsv',sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [110]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [114]:
df.loc[0]  #0은 라벨
df.iloc[0] #0은 숫자인덱스임

country      Afghanistan
continent           Asia
year                1952
lifeExp        28.801000
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [115]:
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp       43.453000
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [117]:
df.loc[1703]

country        Zimbabwe
continent        Africa
year               2007
lifeExp       43.487000
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [118]:
df.iloc[-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp       43.487000
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [119]:
df.loc[-1]  #-1이라는 라벨 없기때문에 에러뜸

KeyError: -1

In [120]:
df.shape

(1704, 6)

In [121]:
df.loc[df.shape[0]-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp       43.487000
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [123]:
df.loc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [124]:
df.loc[df.shape[0]-1]  #시리즈로 추출

country        Zimbabwe
continent        Africa
year               2007
lifeExp       43.487000
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [125]:
df.iloc[df.shape[0]-1]  #시리즈로 추출

country        Zimbabwe
continent        Africa
year               2007
lifeExp       43.487000
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [126]:
df.tail(1)   #데이터프레임으로 추출됨

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [127]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [136]:
subset=df.loc[:,['year','pop']]
subset

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [138]:
df
df.iloc[:,[2,4,-1]]

      year       pop   gdpPercap
0     1952   8425333  779.445314
1     1957   9240934  820.853030
2     1962  10267083  853.100710
3     1967  11537966  836.197138
4     1972  13079460  739.981106
...    ...       ...         ...
1699  1987   9216418  706.157306
1700  1992  10704340  693.420786
1701  1997  11404948  792.449960
1702  2002  11926563  672.038623
1703  2007  12311143  469.709298

[1704 rows x 3 columns]

### range객체

In [141]:
list(range(5))

[0, 1, 2, 3, 4]

In [142]:
df.iloc[:,list(range(5))]

          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]

In [143]:
df.iloc[:,list(range(3,6))]

      lifeExp       pop   gdpPercap
0      28.801   8425333  779.445314
1      30.332   9240934  820.853030
2      31.997  10267083  853.100710
3      34.020  11537966  836.197138
4      36.088  13079460  739.981106
...       ...       ...         ...
1699   62.351   9216418  706.157306
1700   60.377  10704340  693.420786
1701   46.809  11404948  792.449960
1702   39.989  11926563  672.038623
1703   43.487  12311143  469.709298

[1704 rows x 3 columns]

In [144]:
df.iloc[:,list(range(0,6,2))]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [145]:
df.iloc[:,0:6:2]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [147]:
df.loc[[0,99,999],['country','lifeExp','gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [150]:
#or
df.iloc[[0,99,999],[0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [152]:
s=pd.Series(range(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [154]:
s[3]=np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

#### count함수

In [155]:
s.count()  #데이터 개수를 세는 함수, 누락값은 제외

9

In [157]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  4.0
3  4.0  3.0  4.0  2.0

In [158]:
df
df.iloc[2,3]=np.nan

In [159]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [160]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

In [162]:
df.count()  #df를 열단위로 count함

0    4
1    4
2    4
3    3
dtype: int64

In [167]:
pip install seaborn

Collecting seaborn
  Downloading seaborn-0.11.1-py3-none-any.whl (285 kB)
     |████████████████████████████████| 285 kB 1.1 MB/s eta 0:00:01
Requirement already satisfied: scipy>=1.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from seaborn) (1.6.1)
Requirement already satisfied: pandas>=0.23 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from seaborn) (1.2.0)
Requirement already satisfied: numpy>=1.15 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from seaborn) (1.19.5)
Requirement already satisfied: matplotlib>=2.2 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from seaborn) (3.3.4)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: pillow>=6.2.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (8.1.2)
Requirement already satisfied: kiwisolver>=1.0.1 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: python-dateutil>=2.1 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: cycler>=0.10 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: six in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from cycler>=0.10->matplotlib>=2.2->seaborn) (1.15.0)
Requirement already satisfied: pytz>=2017.3 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas>=0.23->seaborn) (2020.5)
Installing collected packages: seaborn
Successfully installed seaborn-0.11.1
WARNING: You are using pip version 21.0; however, version 21.0.1 is available.
You should consider upgrading via the '/Library/Frameworks/Python.framework/Versions/3.8/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [168]:
import seaborn as sns

In [169]:
t=sns.load_dataset('titanic')

URLError: <urlopen error [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1124)>

In [170]:
t.count()

NameError: name 't' is not defined

In [172]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int64

In [173]:
s2
#시리즈에 저장된 값이 정수, 문자, 카테고리 값인 경우
#value_counts사용할 수 있음

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int64

### value_count()함수

In [174]:
s2.value_counts() #각각의 데이터가 몇건씩 있는지 확인하는 함수(r의 table과 유사)

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [175]:
df.value_counts()

0    1    2    3
0.0  0.0  3.0  2.0    1
3.0  0.0  2.0  1.0    1
4.0  3.0  4.0  2.0    1
dtype: int64

In [178]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [176]:
df[0]

0    0.0
1    3.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [177]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [179]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int64

In [180]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [183]:
s2.value_counts().sort_index()  #인덱스 기준으로 정렬

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

### sort_values()

In [184]:
s2.sort_values() #값을 기준으로 오름차순

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int64

In [185]:
s2.sort_values(ascending=False)

0     5
74    5
23    5
32    5
40    5
     ..
68    0
57    0
77    0
38    0
78    0
Length: 100, dtype: int64

In [187]:
#df.sort_values()  #에러발생

df.sort_values(by=1)   #by=인덱스번호

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [191]:
df.sort_values(by=3)  #동일한 값이 있을 경우 정렬기준을 여러개 줄 수 있음

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN

In [193]:
#정렬기준 여러개줄때 
df.sort_values(by=[3,1])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN

In [194]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [195]:
sum(df2)

28

In [197]:
df2.sum(axis=0)  #0은 행방향으로 이동해 가면서 계산

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [199]:
df2.sum(axis=1) #열방향으로 이동해가면서 계산

0    35
1    34
2    41
3    42
dtype: int64

In [200]:
df2['rowsum']=df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [201]:
df2.sum(axis=0)

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
rowsum    152
dtype: int64

In [203]:
df2['colsum']=df2.sum(axis=0)
df2  #밑으로 행 인덱스를 추가해야하는데 열로 추가되어버림, 잘못된 결과 발생

   0  1  2  3  4  5  6  7  rowsum  colsum
0  5  8  9  5  0  0  1  7      35      24
1  6  9  2  4  5  2  4  2      34      33
2  4  7  7  9  1  7  0  6      41      25
3  9  9  7  6  9  1  0  1      42      24

In [204]:
del df2['colsum']

In [205]:
df2

   0  1  2  3  4  5  6  7  rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [206]:
# 행 인덱스를 추가할 때는 loc씀

In [207]:
df2.loc['colsum']=df2.sum(axis=0)

In [208]:
df2

         0   1   2   3   4   5  6   7  rowsum
0        5   8   9   5   0   0  1   7      35
1        6   9   2   4   5   2  4   2      34
2        4   7   7   9   1   7  0   6      41
3        9   9   7   6   9   1  0   1      42
colsum  24  33  25  24  15  10  5  16     152

### apply 함수

In [216]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [214]:
df3['A'].min() #최소
df3['A'].max()  #최대

1

In [215]:
#모든 열에 대해서 적용해야할 때

In [ ]:
#df3에게 '함수'를 열단위로 적용해라
df3.apply(함수)

In [217]:
#x에는 df3에 있는 각각의 열이 전달됨
df3.apply(lambda x: x.max())

A    4
B    3
C    5
dtype: int64

In [218]:
df3.apply(lambda x: x.max()-x.min())

A    3
B    2
C    4
dtype: int64

In [219]:
#행단위로 적용
df3.apply(lambda x: x.max()-x.min(),axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [220]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [221]:
#df3에 저장된 각각의 값들에 대해 개수를 세는 함수 구현
#ex)A열에는 1이 1개 ,2가 0개, 3이2개, 4가 2개 , 5가 0개

In [223]:
df3['A'].value_counts().sort_index()

1    1
3    2
4    2
Name: A, dtype: int64

In [224]:
df3['B'].value_counts().sort_index()

1    1
2    2
3    2
Name: B, dtype: int64

In [225]:
df3['C'].value_counts().sort_index()

1    1
2    1
4    2
5    1
Name: C, dtype: int64

In [226]:
df3.apply(pd.value_counts)  #행인덱스가 일치하지 않아서

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [227]:
#퀴즈3

In [228]:
t

NameError: name 't' is not defined

In [229]:
t['adult_child'] = np.where(t['age']>=20, 'adult', 'child')
t
#or
t['adult_child']=['adult' if i>=20 else 'child' for i in t.age]

NameError: name 't' is not defined

In [230]:
t['adult_child2']=t['age'].apply(lambda x:'adult' if x>=20 else 'child',axis=1)

NameError: name 't' is not defined

### fillna():nan 값을 다른 값으로 바꾸는 함수

In [235]:
#fillna
df3.apply(pd.value_counts).fillna(0)  #nan값을 0으로 처리

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### as.type()함수: int나 float으로 바꿔버리기

In [242]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

### cut 함수: 경계를 지정해서 나눔(주로 연속형의 수치데이터를 범주화할때)

### qcut함수: 똑같은 개수의 구간으로 나눔

In [266]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins=[1,20,30,50,70,100]  #나이의 경계 나눠주기(0은 구간을 벗어난 데이터임)

In [267]:
pd.cut(ages,bins)  #cut(나이,구간)  
#Categories (5, interval[int64]): [(1, 20] < (20, 30] < (30, 50] < (50, 70] < (70, 100]]
#-->경계의 시작은 포함을 안하고,끝은 포함 함

[NaN, (1.0, 20.0], (1.0, 20.0], (20.0, 30.0], (20.0, 30.0], ..., (50.0, 70.0], (1.0, 20.0], (30.0, 50.0], (30.0, 50.0], NaN]
Length: 12
Categories (5, interval[int64]): [(1, 20] < (20, 30] < (30, 50] < (50, 70] < (70, 100]]

In [268]:
lb=['미성년','청년','중년','장년','노년']

In [269]:
pd.cut(ages,bins,labels=lb)

[NaN, '미성년', '미성년', '청년', '청년', ..., '장년', '미성년', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년' < '청년' < '중년' < '장년' < '노년']

In [270]:
mycuts=pd.cut(ages,bins,labels=lb)

#### categories속성

In [271]:
mycuts.categories

Index(['미성년', '청년', '중년', '장년', '노년'], dtype='object')

#### codes 속성

In [272]:
mycuts.codes  #0~4번까지(['미성년', '청년', '중년', '장년', '노년'])중에 어느 카테고리에 속하는지
#-1은 카테고리를 벗어난 것

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [273]:
ages

[0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [278]:
df4=pd.DataFrame(ages,columns=['ages'])
df4

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   101

In [277]:
df4['age_cut']=pd.cut(df4,ages,bins,labels=lb)
df4

ValueError: Input array must be 1 dimensional

In [279]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ages    12 non-null     int64
dtypes: int64(1)
memory usage: 224.0 bytes

### 형변환해서 문자열로 바꾸기

In [280]:
#df4['agc_ages']=df4['age_cut']+df4['age'] 에러발생
df4['agc_ages']=df4['age_cut'].astype(str)+df4['age'].astype(str)
df4

KeyError: 'age_cut'

### qcut

In [281]:
data=np.random.randn(20)
data

array([-0.17242821, -0.87785842,  0.04221375,  0.58281521, -1.10061918,
        1.14472371,  0.90159072,  0.50249434,  0.90085595, -0.68372786,
       -0.12289023, -0.93576943, -0.26788808,  0.53035547, -0.69166075,
       -0.39675353, -0.6871727 , -0.84520564, -0.67124613, -0.0126646 ])

In [283]:
mycuts2=pd.qcut(data,4,labels=['q1','q2','q3','q4'])
mycuts2  #각각의 구간에 5개씩 들어감

['q3', 'q1', 'q3', 'q4', 'q1', ..., 'q2', 'q2', 'q1', 'q2', 'q3']
Length: 20
Categories (4, object): ['q1' < 'q2' < 'q3' < 'q4']

In [284]:
pd.value_counts(mycuts2)

q1    5
q2    5
q3    5
q4    5
dtype: int64

### Set_index, reset_index함수: 행/열 인덱스 교환

In [285]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])

In [286]:
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### set_index: 특정 열을 인덱스로 설정->기존의 인덱스는 제거됨

In [287]:
df2=df1.set_index('C1')

In [288]:
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [289]:
df2.set_index('C2')

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

### reset_index():인덱스를 일반적인 자료형으로 만들 수 있음(맨 왼쪽으로 추가됨)

In [290]:
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [291]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [293]:
#df2에서 index열을 제거 
df2.reset_index(drop=True)

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [299]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns=[['A','A','B','B'],
                      ['M','F','M','F']])
df3

#0,1번 열은 A부서의 남,여의 실적
#2,3열은 B부서 남,여의 실적

      A           B
      M     F     M     F
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

#### columns.names()위 처럼 다중인덱스에 이름 부여하는 것

In [300]:
df3.columns.names=['Dept','Sex']

In [301]:
df3

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [302]:
 np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])# *2는 주번 반복 의미
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

### stack함수: 열인덱스->행인덱스

In [303]:
#다중인덱스에서 열 인덱스-> 행인덱스 (열 인덱스가 90도 반시계 방향 회전)

In [304]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [305]:
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [307]:
df4.stack('Cidx2')

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [308]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [309]:
df4.stack(0)

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

### unstack함수: 행->열(행 인덱스가 90도 반시계 방향 회전)

In [310]:
df4.unstack('Ridx2')

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [311]:
df4.unstack(1)

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [312]:
df3

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [313]:
df3[('B')]

Sex     M     F
0    0.98  2.24
1    0.95 -0.15
2    0.14  1.45
3    0.44  0.33
4    0.31 -0.85

In [314]:
df3[('B','M')]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, M), dtype: float64

In [315]:
df3

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [316]:
df3.loc[0]

Dept  Sex
A     M      1.76
      F      0.40
B     M      0.98
      F      2.24
Name: 0, dtype: float64

In [317]:
df3.iloc[0]

Dept  Sex
A     M      1.76
      F      0.40
B     M      0.98
      F      2.24
Name: 0, dtype: float64

In [321]:
df3.loc[0,('B','M')]=999
df3

Dept     A             B
Sex      M     F       M     F
0     1.76  0.40  999.00  2.24
1     1.87 -0.98    0.95 -0.15
2    -0.10  0.41    0.14  1.45
3     0.76  0.12    0.44  0.33
4     1.49 -0.21    0.31 -0.85

In [322]:
df3.iloc[0,2]

999.0

In [325]:
df3.iloc[4,1]
#or
df3.loc[(4),('A','F')]

-0.21

In [326]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [328]:
df4.loc[('M','id_1'),('A','C')]

1.76

In [329]:
df4.loc[:,('A','C')]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64

In [333]:
df4.loc[('M','id_1'),:]

Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

In [335]:
df4.sum()
#or
df4.sum(axis=0)

Cidx1  Cidx2
A      C        3.23
       D        0.39
B      C        3.68
       D        2.28
dtype: float64

In [336]:
df4.sum(axis=1)

Ridx1  Ridx2
M      id_1     5.38
       id_2     1.69
       id_3     1.90
F      id_1     1.65
       id_2     0.74
       id_3    -1.78
dtype: float64

In [339]:
 np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])# *2는 주번 반복 의미
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [340]:
df4.loc[('Tot','Tot'),:]= df4.sum()
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

### swaplevel():인덱스 순서 변경

In [345]:
#Ridx1과 Ridx2의 순서 변경
df5=df4.swaplevel('Ridx1','Ridx2')

In [343]:
df4.swaplevel('Cidx1','Cidx2',1)

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [346]:
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [347]:
df5.sort_index(level=0)  #Ridx2기준으로 정렬

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
Tot   Tot    3.23  0.39  3.68  2.28
id_1  F      0.76  0.12  0.44  0.33
      M      1.76  0.40  0.98  2.24
id_2  F      1.49 -0.21  0.31 -0.85
      M      1.87 -0.98  0.95 -0.15
id_3  F     -2.55  0.65  0.86 -0.74
      M     -0.10  0.41  0.14  1.45

In [348]:
df5.sort_index(level=1) #Ridx1기준으로 정렬

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
Tot   Tot    3.23  0.39  3.68  2.28